gets
current
action
bar
instance
sets
extra
options
influence
ui
window
content
activity
inside
visibility
progress
title
indeterminate
bars
secondary
menu
inflater
supports
newer
attributes
custom
navigation
mode
supplying
view
icon
display
`
home
'
section
logo
adapter
callback
list
selected
item
tabbed
modes
position
number
items
present
's
subtitle
null
disable
UNK
whether
rather
include
application
affordance
displayed
``
''
true
selecting
returns
single
level
back
top
front
page
background
stacked
split
standard
adds
tab
use
removes
tabs
currently
least
one
specified
index
registered
listener
respond
change
events
associated
text
used
description
accessibility
support
brief
length
animation
animator
started
yet
ended
listeners
sent
life
start
repeat
end
listening
object
target
whose
property
animated
set
play
supplied
animations
time
previous
ends
child
objects
controlled
dependency
node
value
keyframe
fraction
overall
duration
optional
interpolator
type
evaluator
calculating
values
name
@param
the
ints
floats
keyframes
setter
getter
requested
int
float
animate
per
animates
point
equal
minus
many
times
repeated
update
frame
updates
timing
uses
recent
running
expandable
cells
fields
layout
params
given
creates
new
data
later
presenter
optionally
forces
views
ordering
across
shortcuts
visible
header
notified
related
specific
presentation
id
determining
state
parcelable
describing
default
displaying
enabled
shortcut
right
questions
asked
enter
screen
configuration
transitioning
invoke
dispatching
button
presses
widget
provides
represent
within
descendant
first
last
show
empty
drawable
divider
padding
dividers
width
draw
NUMBER
upper
limit
range
...
max
acceleration
curve
positions
spinner
prompt
dialog
shown
hint
user
tag
actions
take
focus
sub-menu
group
corresponding
performed
particular
intent
identifier
existing
leaving
created
part
category
order
char
alphabetic
check
mark
invoked
invocation
information
linked
presence
expanded
submenu
<var>
res
</var>
resource
model
backed
contents
provided
file
historical
chosen
activities
handle
choosing
defined
highest
rank
i.e.
based
maximal
size
history
record
expands
overflow
provider
hosting
applicable
popup
receive
dismissed
initial
count
lazily
initialized
false
otherwise
searchable
info
search
a
legacy
ime
query
field
input
inform
changes
suggestion
focused
clicked
pressed
string
well
iconified
submit
necessary
never
refinement
ones
suggestions
maximum
pixels
zero
box
without
updating
launch
voice
web
perform
forward
results
contains
whitespace
share
targets
persisted
sessions
chooser
policy
needed
preference
image
makes
sure
uri
using
cache
side
column
my
fragment
arguments
counting
providing
num
argument
details
underlying
database
table
names
taken
note
pad
class
mime
known
condition
applies
behavior
chain
result
successful
attempt
failed
output
absent
produced
failure
encountered
obtain
different
appropriate
sql
clause
instructions
read
timeout
milliseconds
connection
response
body
code
message
scheme
registry
fix
no
http
exception
issue
ssl
verification
port
must
greater
https
client
context
logging
flag
log
interface
setting
library
implementation
verbose
executor
service
pool
agent
request
parallel
connections
@return
socket
factory
making
requests
retries
bearer
authentication
basic
previously
auth
credentials
headers
android
initiated
entity
containing
included
declaration
charset
byte
array
@throws
java.io.
reading
creating
status
line
parsed
throwable
way
error
escaped
key
store
certificate
cert
stream
trusts
certificates
cookie
decoded
returned
task
completed
cancelled
normally
key/value
pair
files
content-type
param
long
parameter
additional
upload
json
streamer
hold
took
payload
global
determines
automatically
close
streams
parameters
successfully
retrieving
fails
cause
origin
-lsb-
-rsb-
handler
asynchronous
synchronous
boolean
executed
thread
run
singleton
rest
indicating
found
system
preferences
millis
accessed
representing
main
component
injection
module
remote
url
place
holder
loading
downloaded
build
element
colors
inflated
pager
caching
pages
y
scrollable
touch
motion
event
color
integer
alpha
on
played
pull
happens
updated
refresh
released
typeface
style
filtered
wrapped
refreshing
scrolling
indicator
happen
xml
may
trim
arc
amount
rotation
apply
resources
dimensions
lower
logged
root
directory
disk
cached
original
<b>
</b>
n't
incoming
deleted
exist
ca
journal
omits
redundant
stores
bytes
closed
editor
snapshot
entry
either
changed
since
another
edit
committed
lengths
decimal
numbers
like
entries
total
remaining
keys
occurrence
deque
elements
iterator
proper
sequence
reverse
sequential
runtime
successor
non-null
possibly
folder
primary
becomes
unavailable
loaded
memory
decoding
delay
starting
bitmap
processor
process
bitmaps
aware
height
collected
gc
execution
load
tasks
images
priority
threads
queue
processing
generator
responsible
notification
tracking
session
genres
collection
music
tracks
media
metadata
d
server
caches
track
future
reference
grouping
latest
playback
determined
caller
auto
car
dock
represents
theme
attribute
tv
c
detect
methods
includes
implemented
interfaces
unique
around
post
method
mapping
duplicate
called
occurs
template
scroll
drag
fade
pane
covered
sliding
become
fully
collapsed
panel
val
shadow
offset
minimum
velocity
slide
draggable
portion
helper
anchor
stop
overlays
clipped
clip
enum
magnitude
horizontal
vertical
detected
second
configured
edge
find
parent
coordinate
slides
added
vibration
buttons
on/off
wizard
intensity
desired
instead
dots
transitions
intro
zoom
flow
over
depth
swipe
direction
factor
inserted
app
actual
simple
cleaning
command
javac
jar
source
path
resulting
manifest
filename
normalized
timestamp
epoch
plugins
immutable
non-
bazel
flags
plugin
compiler
jars
direct
dependencies
indirect
map
collecting
explicit
implicit
suggest
missing
strict
classpath
checking
mappings
contain
protocol
buffer
format
artifacts
compile-time
canonical
version
symbol
available
corresponds
sources
compiled
javacopts
including
bootclasspath
boot
private
members
iff
tree
could
constant
manager
owns
location
delegates
option
test
case
tests
filter
applied
filtering
suites
runner
codes
<ul>
<li>
etc.
exit
</li>
normal
all
pass
signal
handlers
regular
expression
inclusive
exclusive
match
suite
represented
writer
testing
purposes
writing
sharding
weight
extracted
shard
<
=
shards
environment
indicate
according
strategy
subclass
generic
exactly
frequency
ignoring
form
literal
increment
ticker
whenever
queried
representation
nanoseconds
elapsed
fixed
safe
characters
escaper
replacement
outside
character
builder
copied
meta-
f
zip
combiner
date
magic
merge
combined
already
written
copy
entire
exists
encoding
comment
raw
central
expected
actually
zip64
modification
-1
uncompressed
compressed
compression
made
accounting
assigned
feature
extract
general
purpose
bit
clears
internal
external
local
none
partial
documentation
rule
printed
rules
family
unmatched
html
srcs
variable
printable
public
signature
links
common
deps
explicitly
documents
marked
doc
shortest
definition
graph
types
formatted
skylark
link
annotation
top-level
modules
functions
command-line
api
identifies
inputs
need
allow
extra_action
correctly
remotely
regardless
discovered
estimate
operation
consumption
host
scheduling
owner
executable
supply
pretty
suitable
messages
tool
depends
upon
variables
required
saved
iterable
prior
executing
strategies
causes
reported
significant
might
get
complete
active
preparing
showing
seconds
wait
reporting
digest
artifact
relative
paths
label
short
beneath
resides
middleman
fileset
exec
potential
shell
tail
packages
roots
root-relative
unknown
analysis
uniquely
--
md5
outputs
corrupted
ignored
fast
omitted
throws
obtained
would
big
implements
head
small
prefix
clock
failures
blaze
spawn
full
traversal
refers
whole
package
recursive
points
generated
symlink
symlinks
hits
mapped
basenames
excluded
nested
fingerprint
wrapping
referenced
lock
non-zero
cpu
usage
io
i/
o
derived
runfiles
directories
scheduled
write
fallback
describes
placeholder
genfiles
estimated
enough
always
archive
argv
truncated
appending
ellipsis
occurred
execute
tools
transitive
inherited
interpreted
java
deploy
interned
commands
multiple
delegate
compute
takes
generates
expand
loads
errors
generating
far
analyzed
skyframe
sky
workspace
providers
collections
qualified
appearing
filesystem
belong
base
hosts
scratch
also
working
dir
valid
repository
stored
temporarily
installed
embedded
binaries
shared
install
summary
binary
built
release
populated
pairs
configurations
aspects
to
dynamic
possible
config
matching
instances
configurable
equivalent
requirements
scanning
launcher
make
features
fragments
classes
outgoing
reached
kind
transition
traversing
bound
recognized
bin
separator
platform
instrumentation
identify
instrumented
coverage
_
matched
unordered
lines
defaults
extended
sanity
checks
building
structure
analyze
compilation
space
environments
compatible
directly
taking
applying
multimap
labels
keyed
something
goes
wrong
contained
copies
recorded
matcher
conditions
report
throwing
settings
adjusted
identified
parsing
evaluating
aspect
two
considered
deprecation
warnings
warning
prerequisite
described
factories
supported
languages
creator
even
require
certain
instantiated
good
reports
problems
restricted
along
groups
appear
selects
select
static
specifies
evaluated
pointed
ids
dependent
nodes
sorted
triggers
late-bound
dep
resolver
attr
visited
combination
ready
moment
wrapper
piece
license
inserting
container
expansion
advances
declared
pseudo
thus
guaranteeing
clashes
go
attached
feed
prerequisites
feeds
listed
referred
expanding
references
t
function
extension
determine
constructed
evaluation
suffix
unconditional
pruning
candidates
adding
account
manifests
conflicts
several
closure
respective
owning
conditional
writes
unmodifiable
args
installation
try
cast
know
specification
dummy
hostname
terminated
crosstool
proto
c++
correct
chaining
phase
human-readable
non-default
/
attempted
participate
printing
success
prefixes
user-friendly
pkg
repositories
concurrent
call
parser
pattern
suffixes
verified
maps
pointer
changing
next
fresh
arrays
+
resizing
storage
stable
compile
approximate
occupied
interrupted
jobs
following
properties
mutable
lists
example
<i>
</i>
handled
relating
region
subset
ending
beginning
offsets
refer
denoted
matches
out
err
sends
reporter
virtual
're
constructing
absolute
directed
edges
connectivity
relation
strong
partition
expressed
domain
post-order
serialized
computed
via
binding
>
comes
predicate
mandatory
native
validity
checker
logical
produce
checked
skips
evaluates
allowed
naming
designates
replica
indices
named
selection
selector
reserved
words
intended
question
processed
computes
transitively
glob
construct
defines
copts
append
duplicates
preprocessor
finds
implementing
looking
getting
python
macro
cc_binary
foo
effective
tags
overrides
hash
advertised
provide
access
constraint
bindings
contributes
subject
every
creation
decision
belongs
e.g.
distribution
keyword
accepts
language
suggested
various
parts
compiles
x.
retained
still
recently
sync
statistics
anymore
reduce
builds
locator
looked
ordered
read-only
chart
row
existed
textual
stat
aggregate
profiler
cumulative
dimension
profile
incomplete
ns
critical
nano
arbitrary
stack
stats
accumulated
aggregation
durations
calls
built-in
excluding
user-defined
word
tokens
define
strings
better
consumed
token
equivalence
formatter
user-visible
dom
precomputed
aapt
generate
symbols
apk
sdk
intermediate
dex
generation
jack
idl_srcs
idl_parcelables
debug
signed
located
consisting
marker
convert
union
libraries
parse
protobuf
immediate
passed
typically
translation
compiling
signing
contribute
individual
depending
merged
archives
useful
else
operate
final
operations
extractor
converted
processors
exported
depend
placed
non
correspond
bitcode
ios
xcode
propagated
apple
provisioning
steps
resolving
toolchain
frameworks
swift
series
configure
recommended
device
simulator
appears
platforms
plist
struct
versions
regarding
accepted
aliases
pre-initialized
nocopts
regex
linker
scripts
temp
linking
overlap
unit
pic
linkstamps
produces
c/
cc
identifiers
therefore
linkstamp
control
selectable
requirement
hints
strip
solib
live
collect
lipo
i
iquote
inclusion
statements
needs
discovery
gcc
put
look
cpp
semantics
reply
forms
n
resolution
partitions
separate
independent
statically
mostly
temporary
skipped
automatic
gnu
binutils
architecture
identical
specifically
fdo
linux
subtype
extensions
done
block
inclusions
dotd
requires
validation
specify
candidate
collects
imports
relevant
discover
special
validate
capturing
permitted
scanner
scan
implicitly
supposed
fake
consists
late
stub
removing
replacing
jvm
enable
force
machine
implement
emitted
emits
combining
affected
translations
disabled
constraints
fully-qualified
tells
replaced
jdk
ever
script
treated
proguard
spec
validated
protos
invalid
watch
bundle
families
os
bundles
merging
substitutions
accessible
dependers
imported
dependents
individually
clang
for
obj
j2
pruned
project
framework
dsym
entitlements
copying
dead
removed
removal
prefixed
among
objc
devices
exposed
declaring
wo
structured
plan
seen
filters
propagate
add
overwrites
enabling
xcodegen
companion
product
controls
specifying
projects
import
init
resolves
trace
utf-8
baseline
hardware
r
attempts
thrown
human
readable
runs
dispatcher
dispatches
help
startup
consumers
contexts
namespace
logger
soon
in-memory
persistent
uuid
everything
spent
garbage
categories
descriptive
core
runnable
worth
respect
work
terminal
effects
rate
limits
locally
allowing
construction
supplier
posix
open
writable
continue
indicates
finished
timed
stdout
stderr
appended
termination
observed
observer
restart
enqueued
together
requesting
completion
modified
proxy
dirty
occur
real
ancestor
consideration
lookup
consistent
concurrency
prepare
stripped
away
bus
posting
buffers
consider
granularity
monitor
diff
problem
caught
dictionary
initializes
lhs
assignment
rhs
scope
operator
resolved
calculated
print
statement
sub
super
scopes
parents
due
non-empty
acceptable
annotated
callable
annotations
registering
conflict
expressions
criteria
retrieved
came
slice
immediately
tuple
associate
denotes
concatenation
inode
symbolic
uid
gid
sticky
infrastructure
numeric
handles
nothing
remove
grouped
foreground
recording
abstract
means
shift
higher
capacity
save
non-hidden
shell-escaped
sensitive
pid
kb
physical
inactive
operating
heap
measurement
idle
utilization
jiffies
ms.
average
minute
free
ms
kernel
trie
comma-separated
english
quotes
ordinal
approximation
profiled
double
slashes
hard
permissions
accessing
starts
emulated
identity
ioexception
leaves
debugging
entities
segment
unix
permission
resolve
fall
windows
opaque
caused
worker
children
meaning
old
resets
transient
computation
delayed
scheduler
trying
cycle
in
or
throw
indicated
giving
exceptions
computing
listing
variant
scoped
predecessors
basename
mapper
setup
plus
falling
unspecified
retrieves
maintained
assuming
b
counter
incremented
intervals
testable
exact
if
an
comparison
builders
splits
override
collector
internally
and/or
passed-in
assets
syntax
serialize
overwriting
asset
definitions
formats
beyond
navigable
descriptor
backing
newly
mirrors
primitive
conversion
blocks
mirror
equals
constructor
innermost
enclosing
effectively
captured
of
owned
kinds
defining
leaf
compound
receiver
anonymous
floating
left
wildcard
this
users
mac
x
expects
keystore
encoded
key-value
iterate
ascii
step
document
circle
badge
bottom
unread
whatever
font
callbacks
drawn
behind
begins
bytecode
utf8
invokedynamic
algorithm
designated
bootstrap
subroutine
sort
instruction
opcode
e
injected
lazy
<t>
plain
adapters
gating
sequences
interval
histogram
population
cursor
ring
published
combines
batch
consume
barrier
producer
publish
safely
unsafe
address
backs
realm
username
password
role
jersey
shutdown
period
detailed
admin
loader
metrics
validator
health
driver
jdbc
managed
dao
components
friendly
raised
connector
timer
servlet
protected
initialization
security
redirects
j
n.
b.
urls
daos
framed
proceeding
score
docs
boost
docvalue
rescorer
consecutive
executions
fqcn
proxies
suppressed
initialize
decisions
sizes
explanation
allocation
cluster
turn
fetched
unassigned
allocated
relocating
reason
fetch
verify
registration
allows
retry
multi-index
partially
snapshotted
returning
repository-specific
snapshots
ignore
restored
rename
restore
added/changed
holds
replicas
alias
routing
analyzer
tokenizer
flush
retrieve
concrete
opened
only
rollover
met
age
pointing
statuses
switching
delete
templates
upgrade
oldest
lucene
relates
wildcards
backoff
fail
bulk
pending
composite
composed
happened
versioning
operates
un
compress
indexed
ttl
ingest
pipeline
indexing
received
multi
concurrently
followed
meet
acknowledgement
acknowledged
master
<em>
</em>
responses
ok
proceed
redirect
term
masks
mock
freq
vector
artificial
vectors
skip
==
overridden
analyzers
terms
insert
able
bind
ports
elasticsearch
codebase
clients
issued
samples
searching
clean
connected
transport
connect
addresses
persistence
states
metric
serializable
serializer
meta
tombstones
indexes
na
wanted
comparing
processes
stamp
delta
threshold
balancer
allocator
canceled
manages
in-flight
throttle
yes
assign
unsuccessful
initializing
relocation
ip
recovery
interleaving
ie
illegal
seed
allocations
reasons
negative
waiting
blob
chars
neither
tripping
circuit
breaker
aggregated
maybe
trip
ref
compact
association
fluent
stopped
center
circles
longitude
latitude
radius
polygon
hole
linear
coordinates
shape
shapes
intersection
geohashes
geohash
distance
stage
injector
by
member
calling
attaches
binder
satisfies
converters
reader
segments
scorer
phrase
slop
percentage
more
readers
former
frequencies
tracked
five
units
so_
recycler
consumer
dynamically
holding
keeps
patterns
slots
longs
grow
min
rotated
retain
aggressive
high
potentially
refreshes
refreshed
accumulating
zen
likely
fault
detection
ping
join
detail
serialization
locations
async
ongoing
comparator
compared
queries
codec
commit
engine
throttling
translog
positive
auto-generated
delivered
engines
buffered
much
bits
multi-valued
iteration
geo
distinct
lenient
leading
asynchronously
transaction
clear
mappers
unprocessed
encode
precision
hierarchy
scoring
clauses
cutoff
low
frequent
hit
random
corner
bounding
corners
calculation
want
malformed
inner
reusing
executes
fuzzy
should
controlling
handling
moving
increments
escaping
from/to
locale
lowercase
span
large
recovered
sum
cleanup
guaranteed
receiving
ops
pre
longer
chunk
reused
clazz
percent
swap
bean
descriptors
resolvers
similar
deletion
cors
origins
!
accept
stacktrace
aggregator
buckets
deferred
collectors
bucket
chained
rounding
bounds
ranges
exclude
counts
k
wrap
percentile
percentiles
xcontent
combine
highlight
gap
calculate
cost
smoothing
avg
usually
windowed
predictions
filled
fit
serial
difference
zone
terminate
aggregations
highlighter
suggester
highlighting
break
eligible
highlighted
encoder
styled
cases
rescoring
targeted
sorting
query-time
meters
geolocation
levels
edits
automaton
defaulting
corrected
minimal
correction
collation
accuracy
finishes
notifies
notify
appropriately
no_
cancellation
cancellable
wraps
channels
keep
smallest
calendar
iso
dates
four
digit
year
month
day
weekyear
week
hour
satisfy
&
fill
randomized
lookups
ipv6
clone
tested
equality
compatibility
modifier
decay
randomly
come
three
renders
reset
rectangle
performance
mean
variance
covariance
coefficient
matrix
loops
site
undefined
bridge
synthetic
initializer
program
avoid
percolate
percolated
sub-requests
destination
preflight
channel
decode
endpoint
describe
aws
is
manage
google
cloud
associates
network
ratio
scaled
preserve
es
properly
expect
except
send
ignores
simulating
unresponsive
failing
communication
audio
sample
frames
rendered
decoder
vorbis
packets
comments
syncframe
capabilities
passthrough
volume
speed
playing
renderer
player
upstream
subsequent
microseconds
drm
closest
synchronization
packet
state_
wav
extent
capable
supporting
queued
outputting
preferred
secure
gain
video
held
switch
cues
timeline
begin
belonging
chunks
controller
caption
spans
larger
dot
rfc
hex
comma
frame-rate
dropped
schedule
layouts
axis
cross
loop
preview
prefetch
backend
diagnostics
canvas
rendering
gesture
detector
viewport
overlay
layers
paint
opacity
transformed
hidden
rounded
round
rounds
radii
border
drawing
scale
transformation
transform
lowest
layer
keeping
click
drawee
stubbed
displays
fresco
create
unnamed
cloned
give
subscribes
subscriber
staging
area
quality
bucketed
freelist
pooled
jpeg
job
angle
orientation
resize
thumbnails
cap
trigger
eviction
going
exclusively
rotate
inputstream
download
pointers
callers
pivot
radians
photos
photo
zoomable
view-absolute
transforms
centered
left/right
tap
huge
balance
identifying
blocking
#
degrees
exif
lifecycle
transactions
mixed
invalidated
paused
thumbnail
less
recycled
modify
gif
transparent
sqlite
columns
trailing
and
not
where
ascending
descending
prepared
schema
sparse
substring
unicode
escape
\
hexadecimal
digits
converter
converts
iterables
performs
composition
skipping
thread-safe
tables
prevent
evicted
strength
compare
expired
sun.misc.
inverse
bimap
occurrences
multiset
endpoints
forwarded
reversed
newly-created
natural
multisets
cell
preventing
weak
indefinitely
cycles
transformer
greatest
nonzero
orders
rows
thread-local
unable
posted
dispatched
subscribers
dispatch
subscribe
insertion
connecting
integers
fashion
concatenating
alternate
opening
reads
m.
p
dataset
specifier
inet
ipv4
ffff
leftmost
unsigned
dividend
divisor
quantities
%
loadable
attempting
synchronized
futures
entered
satisfied
nanos
unless
suspended
daemon
tester
unchanged
combinations
expire
after
soft
drops
sink
delays
camera
hystrix
hook
java.lang.
clockwise
ion
conference
wifi
card
feedback
hours
party
slot
minutes
stars
cards
person
wi
fi
succeeded
analytics
apps
impl
db
drawer
appearance
room
tile
multicast
svg
picture
localized
authenticator
interested
completes
shelf
lottery
ticket
submitted
mutex
sender
promise
fulfilled
fixture
enumeration
arg
separated
outer
specs
superclasses
money
overriding
pos
sealed
js
severity
issues
folders
storing
gradle-based
lint
wider
self
wants
gradle
recursively
effect
intersect
granted
revocable
m
formatting
prefer
gl
egl
surface
sound
l
fullscreen
iosapplication
keyboard
press
sibling
discarding
rgba8888
pixel
y.
rgb
quaternion
z-axis
multiplied
translational
projection
near
plane
scaling
diagonal
euler
angles
x-component
y-component
z
z-component
formal
declares
framebuffer
prev
shares
duplicated
increases
converting
sliced
pname
uniform
vertex
shader
attachment
attach
world
mass
angular
fixtures
damping
sleep
joints
gravity
isolated
vertices
manifold
contact
friction
restitution
sensor
density
joint
reaction
torque
body2
gear
motor
n-m
primitives
constrain
bodies
clearing
globally
aabb
areas
hull
centroid
inverted
interpolated
alter
alters
squared
contacts
particle
particles
reuse
mesh
glyph
insensitive
move
gradient
outline
stroke
blur
glyphs
texture
alphanumeric
descent
ascent
textures
looping
panning
regions
tint
blending
extends
patch
draw-time
patches
middle
emitter
packed
pixmap
sprite
flip
atlas
considering
material
red
green
blue
decal
axes
locate
src
blend
func
dst
face
plug
align
emission
mouse
moved
white
enables
meshes
triangle
gl_
s
matrices
uploaded
render
on-screen
tiles
horizontally
vertically
counter-clockwise
y-coordinates
x-coordinate
y-coordinate
ray
counterclockwise
ellipse
frustum
sphere
clipping
grid
nearest
sine
cosine
power
largest
facing
w
pitch
square
v
x-axis
tcp
connects
actor
capture
tinted
actors
dragged
up
descendants
pref
alignment
widgets
choice
visual
clamped
interpolation
scrolled
choices
slider
x-position
knob
y-position
circular
movement
indentation
icons
listen
drop
clipboard
locales
qualifier
deserialization
spot
light
directional
screenshot
dragging
touched
swiping
undo
touching
fonts
clickable
atributtes
profiles
dp
translucent
toolbar
toggle
insets
mini
footer
fire
switcher
stay
placeholders
rtl
zoomed
recyclable
mppoint
zooming
borders
y-axis
animating
gestures
touches
legend
chart.
drawables
slices
pie
radar
dashed-line
dash
spacing
indicators
y-value
candle
x-value
meets
value-labels
filling
shifted
parcel
rectangles
diagnostic
fsize
arena
tiny
deallocations
subpage
served
big-endian
sized
records
dns
protocols
triggered
browser
content-
increasing
multipart
boundary
discarded
delimiter
disposition
cleaned
handshake
handshaker
stream-
transmitted
inbound
exceeded
push
http/2
basis
extras
authenticated
socks
transfer
reducer
cancels
blocked
heuristic
guide
workers
fork
negotiation
peer
cipher
ssl/
established
proposed
presented
older
tls
encrypted
pem
trust
transferred
traffic
limited
hostnames
servers
domains
deep
water
backlog
binds
aid
sending
sctp
authority
early
http/1
.1
verifier
challenge
pinned
route
apis
cookies
credential
interceptors
observe
confirm
trusted
authorization
intercept
uuids
advertising
capability
advertisement
bluetooth
gatt
services
manufacturer
transmission
dbm
notifications
opted
pws
pw
rssi
tx
jsonobject
jsonarray
transformations
passing
exiting
spaces
rect
clicks
type_
editable
performing
scrolls
content-description
focusable
checkable
magnification
unscaled
screen-relative
focal
magnified
mask
launched
accounts
authorized
hashcode
repeating
requiring
re-created
hide
elevation
multi-window
interacting
recents
decor
resized
maintain
docked
lockscreen
kept
monkey
actively
locking
scene
meant
broadcast
epicenter
expiration
admins
participating
passwords
restrictions
management
let
wall
alarm
alert
op
restriction
vendor-specific
assist
activated
interruption
whitelist
roaming
mobile
placing
detached
popping
bread
managers
crumb
entering
deadline
latency
keyguard
locked
pin
sim
unlock
routes
wearable
vibrate
replies
conversation
remain
obtaining
completely
meta-data
shows
hand
launching
system-level
night
measured
uids
alternative
wallpaper
inflating
paired
chipset
rfcomm
band
characteristic
hosted
characteristics
battery
headset
ag
gateway
pbap
advertise
connectable
le
receives
periodic
syncs
authorities
sampling
looper
shared/external
application-specific
databases
uris
badging
ephemeral
applications
booted
interaction
sms
dialer
pm
mret
unresolved
themed
translator
clamp
typed
atomically
january
utc
ipc
pre-filled
register
counted
behalf
wal
dump
cameras
hal
pictures
recorder
rates
fps
gps
altitude
flash
exposure
compensation
auto-exposure
auto-white
metering
stabilization
reprocess
reprocessable
streaming
surfaces
previously-added
disconnected
vendor
measurements
lens
shading
proximity
finger
cec
mhl
hdmi
mute
hub
wide
software
peak
mips
milliwatts
sensors
geofence
monitoring
monitored
technologies
publisher
mem
announcement
emergency
radio
wake
keyphrase
accessory
usb
anything
vpn
tetherable
fd
networks
v6
txt
carrier
psk
agree
best
sanitizer
unregistered
sanitized
ndef
nfc
mifare
barcode
charging
long.
phone
supplicant
uptime
realtime
discharge
discharged
tracker
election
pss
indication
oem
per-user
physically
removable
posts
delivery
sockets
brightness
adjust
mount
mounted
volumes
crypto
mtp
unbounded
penalty
login
stopping
guest
dialogs
margins
portrait
duplex
printer
printers
destroyed
enterprise
precedence
country
just-sent
mms
dream
dozing
synthesis
speech
text-to-speech
tts
paragraph
directionality
dir_
boring
aligned
timezone
indent
margin
markup
inset
modifiers
capitalization
iterator.
destinations
propagation
fading
mstart
mend
interpolate
intrinsic
rational
zones
important
serves
luminance
touchable
bitfield
subtypes
keycode
|
stylus
movements
hotspot
forming
dequeued
spell
others
faded
scrollbar
fires
actionable
perspective
android.
optical
measure
focus_
constants
black
picker
saves
user-agent
scroller
thumb
arrow
alphabet
auto-complete
drop-down
disappears
weeks
argb
activation
gallery
crop
modal
rating
switches
frozen
view_text
subsystem
wi-
set-like
message.target
grabbed
from
drags
subscription
nine
colormatrix
yuv
ripple
multiply
oval
advance
widths
contour
wind
round-rectangle
rx
self-signed
attestation
instant
encryption
decryption
mix
bearing
leap
gnss
bias
sub-nanosecond
drift
satellite
carrier-to-noise
db-
hz
pseudorange
m/s
rf
multi-path
sub-system
noise
nmea
fused
preset
ringtone
channel_
environmental
reverb
reverberation
reflections
equalizer
microphone
exclusion
camcorder
ifd
jet
encrypt
a/
sampled
router
dvb
instantiating
will
non-image
activate
af
sensitivity
android.sensor.info.sensitivity
android.sensor.info.exposure
ensure
ee
obex
freeform
unfocused
dim
heads
sb
tid
texture_
rs
transpose
glsl
aout
opt
convolve
as-is
synchronize
keyset
vr
r1
r0
keysets
rejected
telecom
conferenced
disconnect
voicemail
cdma
notifier
asu
evdo
ec/
lte
gsm
icc
name_
source_
sim_
phones
telephony
msisdn
mail
apdu
properties.
icc_
operator_
uce
sip
sec
rlmi
quad
expectation
populate
replace
byte-array
tlv
nan
bonjour
wpa_supplicant
p2p
upn
net
handover
procedure
bssid
directive
decide
accumulo
presto
catalog
updatable
assignments
isolation
accumulator
tuples
nullable
alive
observable
monitors
table/view
expires
validating
observables
unsubscribed/cancelled
completable
subscribed
simply
completables
subscriptions
emit
emitting
replay
replaying
executors
six
seven
eight
till
emissions
limiting
governed
lockdown
decorating
pass-through
uncaught
singles
email
clusters
asg
chaos
conformity
janitor
conforming
business
jetty
websocket
spark
truststore
serving
non-option
serve
deployed
spring
principal
audit
expose
gauge
jta
hibernate
gemstones
gem
gemstone
aop
advised
beans
putting
advice
pointcut
discoverer
advisor
offending
advisors
pojo
transactional
interceptor
alliance
proxied
invocations
auto-proxying
proxying
prototype
prepended
introduction
fetching
invoker
thread-bound
auto-growing
accessor
autowiring
autowired
constructors
picking
hierarchical
eagerly
autowire
method/constructor
instantiation
lazy-init
persister
groovy
multicaster
ejb
jndi
formatters
currency
transformers
mbean
casing
jmx
exporter
autodetection
comp/env
rmi
soap
export
fixed-rate
jsr-303
quartz
ant-style
nesting
adaptee
adapt
sqlexception
close-suppressing
metedata
savepoint
durable
jms
send/receive
inhibit
jca
broker
marshaller
unmarshaller
stomp
passcode
absence
heartbeat
receipt
reconnect
web-
jpa
container-managed
castor
marshalling
jaxb
dtd
cci
deployment
rollback-only
sse
jackson
max-
hessian
gzip
jax-
url-decoded
detecting
negated
producible
consumes
cache-control
xslt
sub-protocols
sock
topology
supervisor
vert.x
verticle
fluently
multi-map
clustered
clustering
subprotocols
trailer
netty
ha
quorum
key/cert
crl
tcp/
http/
