START
register
an
action
bar
UNK
implementation
.
END
notify
the
that
overflow
menu
has
been
opened
@param
activity
native
internal
method
to
trigger
creation
process
change
title
associated
with
this
get
a
inflater
instance
which
supports
attributes
@return
determine
whether
or
not
device
key
array
list
set
of
listeners
removes
all
from
object
target
being
animated
interpolator
be
used
by
each
child
animation
animator
number
milliseconds
delay
running
start
amount
,
in
should
before
starts
sets
whose
property
will
utility
function
getter
class
defines
how
many
times
repeat
default
value
is
NUMBER
what
do
when
it
end
listening
frame
updates
for
dismiss
popup
and
true
if
were
dismissed
false
otherwise
currently
showing
space
item
views
can
add
presenter
adds
other
methods
shortcuts
visible
on
dispatch
mode
event
's
callback
useful
operations
are
going
performed
as
batch
gone
through
visibility
request
status
root
info
extra
information
label
show
shortcut
icons
items
called
closing
must
public
so
we
via
impl
current
animating
always
replace
override
window
common
code
different
constructor
clear
out
children
jump
directly
specific
adapter
data
maps
point
position
corresponding
selected
null
there
nothing
owned
view
empty
prevent
any
created
searches
matching
row
id
keep
sync
our
enough
restore
screen
state
changed
flag
indicating
shown
around
padding
displayed
both
ends
width
divider
drawable
@hide
internally
framework
draw
progress
indeterminate
define
return
upper
limit
range
...
max
increase
specified
secondary
stop
prompt
display
dialog
use
only
one
defined
keys
parser
pointing
group
tag
listener
respond
events
call
chaining
model
computed
history
note
implements
gets
intent
activities
handle
count
at
given
index
size
loads
provider
applicable
dismisses
already
lazily
initialized
buttons
ime
options
query
text
field
returns
input
type
string
suggestions
makes
most
pixels
@attr
ref
android.
r.styleable
_
pressed
launches
including
special
handling
box
without
updating
create
launch
voice
search
web
contains
whitespace
avoid
replacing
suggestion
clicked
about
share
preference
obtain
live
cursor
tags
cached
overridden
provide
bit
against
content
providers
uri
using
cache
application
icon
component
name
new
fragment
arguments
parse
during
hierarchy
into
have
supplied
then
those
counting
providing
``
num
''
argument
creating
retrieve
its
ui
just
simple
details
`
'
update
based
check
sending
finished
result
initialization
way
want
thread
right
api
restart
handles
loader
cancel
load
completely
reset
helper
take
care
resources
actively
loaded
populate
creates
underlying
database
table
column
names
taken
perform
incoming
queries
mime
known
handler
after
first
worker
executor
go
instruction
continue
processing
apply
filter
predicate
comparator
sort
computes
merged
two
values
declaration
compiled
repository
specifies
source
transform
output
i.e.
observed
queue
backing
storage
present
absent
successful
attempt
produced
failure
encountered
context
instead
receiver
sql
where
clause
off
redirects
read
timeout
connection
http
caches
clients
testing
purposes
response
body
message
requirements
up
date
last
error
retrieving
log
level
across
library
setting
verbose
service
overrides
requests
connections
maximum
least
socket
timeouts
seconds
-1
indicates
scheme
port
username
password
header
contents
authentication
uses
auth
y
you
pass
your
scope
security
basic
previously
credentials
enabled
desired
feature
android
send
runnable
local
loop
original
order
elements
retrieves
file
represents
final
location
possible
representing
url
segment
folder
needs
store
containing
certificate
stream
ssl
factory
certificates
https
delete
cookie
removed
parameter
remove
entity
parameters
s
had
bug
resolving
addresses
singleton
rest
custom
client
serialize
json
deserialize
representation
user
millis
time
was
transformed
collection
executes
case
expose
graph
users
objects
goes
needed
open
initializes
main
dependency
injection
module
invalidate
image
remote
place
holder
assigned
render
layout
scroll
correctly
inflated
tab
tabs
ratio
dragging
canceled
indicate
direction
convert
rgb
color
motion
xml
clears
convenience
!
click
adding
need
because
allows
classes
include
loading
saved
bundle
save
updated
height
adjust
necessary
refresh
footer
pull
held
prepare
spinner
scale
background
circle
alpha
stroke
center
radius
inner
px
arrow
head
between
-lsb-
-rsb-
rotation
specify
implement
delta
>
move
down
back
under
touch
make
top
detect
working
disable
long
longer
once
moved
sent
yes
duration
close
begin
hook
lower
than
logged
msg
throwable
args
debug
warning
fatal
reference
journal
replaces
exists
returned
bytes
files
entries
entry
closed
force
buffered
filesystem
closes
stored
remain
committed
no
does
throw
lengths
decimal
numbers
like
bitmap
<p/>
while
links
node
element
full
@throws
pointer
exception
successor
non-null
but
possibly
deleted
scales
dimensions
<b>
sample
</b>
according
decoding
ioexception
passed
decoded
exif
params
considered
task
disk
primary
unavailable
res
resource
memory
starting
equal
detection
appends
path
configuration
checks
illegal
n't
tasks
download
images
network
paused
resumes
waiting
&
wait
their
turn
pool
priority
threads
displaying
available
app
directory
generator
responsible
detail
logs
execution
cancels
aware
engine
<
/
work
stops
scheduled
interrupted
successfully
decodes
resize
cancelled
collected
gc
reused
another
ca
reads
else
system
posts
notification
tracking
session
token
iterator
over
music
tracks
very
playback
manager
whenever
play
playing
caller
media
try
audio
focus
give
changes
player
done
interface
requires
controls
connectivity
connected
todo
would
map
better
performance
length
limited
extracts
annotated
annotation
processor
well
annotations
finds
until
execute
serial
found
having
identifier
invoke
unregister
server
test
verifies
injected
+
synchronized
catch
classpath
caching
locations
post
mapping
duplicate
occurs
within
e
thrown
variables
mapped
<t>
drag
fade
fixed
pane
sliding
panel
val
shadow
offset
fling
velocity
minimum
slide
anchor
clipped
clip
enum
enable
edge
edges
parent
captured
distance
initiate
further
complete
find
coordinate
transition
fill
bind
?
‰∏ä‰∏ã?ñá
package
åÖ?êç
ñá‰ª∂Ë∑ØÂæ
??
ñá‰ª
é∑?èñ
°Ê
???
dir
paths
p
byte
hex
Â≠óËäÇ?ï∞Áª
char
chars
unit
charset
format
†ºÂº
dp
d
c
òé?ñáÂ≠óËäÇ?ï∞Áª
algorithm
src
dest
append
¶‰
o
Ê∫êÂõæ?âá
x
recycle
border
reflection
edit
domain
phone
command
commands
îÆ
shutdown
terminated
ó∂?ó¥Â≠óÁ¨¶‰∏
</li>
</ul>
zip
next
button
separator
skip
typeface
l
font
located
assets
added
on/off
controller
zoom
flow
depth
transformer
locked
page
scroller
own
swipe
factor
build
jar
generated
prepares
compilation
run
temporary
directories
writing
initializer
outside
recursively
java
builder
manifest
sources
writes
creator
enables
disables
messages
processes
them
skipped
immutable
javac
flags
filters
standard
printed
blaze
compiler
plugins
processed
customize
plugin
jars
direct
dependencies
collecting
explicit
implicit
suggest
fix
missing
strict
invocation
checking
provided
artifacts
collect
ast
marks
visits
selection
statement
canonical
version
private
symbol
corresponds
registers
analysis
requested
write
boot
processors
iff
succeeded
may
tests
tree
could
constant
delegates
compile
additional
option
suite
signal
handlers
prints
stack
print
installed
parses
parsed
did
match
runs
runner
exit
represented
started
now
dynamically
failed
description
entire
writer
document
throws
attribute
double
total
shards
environment
shard
strategy
functions
escaped
form
literal
allow
everything
exported
exporter
f
single
line
more
merge
buffer
copies
combined
filename
external
ensures
truth
expression
involving
calling
never
same
central
fields
contain
extended
required
comment
too
record
payload
copy
exist
overall
reading
generates
raw
actually
encoding
compression
made
extract
purpose
optional
i/
occurred
converts
little
endian
short
int
bits
little-endian
unsigned
timestamp
valid
prefix
positions
yet
identical
calls
results
these
four
expansion
subsequent
unique
partial
assumes
locally
documentation
rule
console
rules
doc
generic
variable
template
pair
deprecated
signature
html
exceptions
such
deps
explicitly
documents
marked
actual
formatted
skylark
top-level
modules
command-line
actions
optionally
insert
inputs
iterable
automatically
might
outputs
proper
exec
building
checker
phase
provides
mechanism
skyframe
owner
active
executing
artifact
visited
concrete
relative
scheduling
middleman
determined
potential
shell
serializes
absolute
strings
ignored
fragments
runfiles
arg
visit
nodes
spawn
--
executable
metadata
effectively
dumps
encoded
fast
md5
digest
even
large
pairs
compute
^
=
operation
arrays
inside
persistent
saves
flushes
either
returning
multimap
concurrently
small
some
tells
timing
looks
normal
releases
resets
much
immediately
block
lock
thread-safe
tries
mappings
backed
placeholder
delimiter
join
fingerprint
performs
setup
archive
members
errors
transitive
produces
inherited
interpreted
multiple
they
expanded
expand
built
applying
targets
refers
construct
completion
non-empty
causes
determines
base
belong
workspace
embedded
shared
install
here
release
populated
evaluated
configured
configurations
except
aspects
dynamic
includes
drops
config
instances
configurable
sanity
generating
reporting
cases
symlinks
features
types
reached
kind
platform
suitable
lines
global
defaults
structure
host
collects
packages
arbitrary
transitions
implemented
overriding
taking
support
labels
zero
every
contained
properly
settings
aspect
supported
definition
upon
certain
environments
select
inserts
owning
also
applied
static
resolves
triggers
split
determining
whole
closure
since
wrapper
language
dependent
meant
merges
groups
equivalent
invalid
conditions
declared
constructs
registry
safe
subclasses
report
warnings
mark
cpu
t
reports
extension
logic
constructed
evaluation
abstract
calculate
existing
pruning
account
policy
symlink
builds
several
nested
still
anything
depend
unmodifiable
cast
above
know
wrong
urls
proxy
address
fully
qualified
built-in
executed
resolve
suffix
temp
regular
invoked
tool
related
human-readable
validates
completed
condition
runtime
crash
symbolic
why
syntax
renders
repositories
validate
validity
success
concurrent
pattern
evaluates
serialization
unset
changing
fresh
chain
exactly
r
compact
hash
stable
link
ordering
schedules
detected
enqueue
released
callable
accessing
typically
statements
're
handled
beginning
redirect
previous
appropriate
particular
matches
registered
allowed
proto
protocol
finish
appear
unbinds
bound
binding
accumulated
consumer
asserts
declares
mandatory
usage
comes
capability
logical
produce
checked
filtering
skips
conversion
part
lists
replica
thing
named
selects
none
selector
means
boolean
integers
fail
validation
non
asynchronously
glob
computation
future
expected
attr
sequence
placeholders
cross
product
equals
depends
debugging
exact
per
records
doing
unless
conflicts
implementing
looking
<li>
access
constraint
bindings
subject
ensure
readable
parsing
parts
sorted
emits
logging
legacy
filtered
statistics
away
ordered
effect
clock
behavior
manually
completes
profiling
elapsed
nanoseconds
chart
vertical
visitor
accept
axis
second
rows
critical
depending
script
recently
definitions
tables
profile
style
percentage
delegate
stat
calculates
action_
h
sorts
immediate
drop
marker
snapshot
stats
recorded
ones
sum
durations
aggregation
excluding
grouped
word
character
forward
reverse
evaluate
scan
consumes
consumed
expressions
correctness
streaming
relation
formatter
intended
sky
unsupported
upload
blob
i
applies
proguard
intermediate
generation
jack
signed
apk
asset
parcelable
roots
compiling
libraries
container
propagate
signals
sdk
coverage
instrumentation
binary
included
align
package-private
replacement
translate
deploy
removal
ap
crosstool
derived
xcode
toolchain
swift
disabled
functionality
accepted
aliases
category
headers
linker
scripts
pic
resulting
c++
overlap
linked
linking
assign
selectable
strip
limits
put
regardless
real
semantics
reply
n
resolution
independent
auto
contexts
subtype
modify
counts
indexing
step
extensions
generate
gives
candidate
stores
prefixes
discovery
identify
supposed
fake
happens
itself
jvm
properties
launcher
problem
wo
represent
initial
translation
e.g.
control
require
expect
stub
treated
validated
watch
objc
interfaces
automatic
fallback
accessible
obj
example
bad
together
combining
os
devices
seen
compatible
project
specifying
invocations
mutable
fetch
describing
casting
reason
export
removing
trace
getting
clean
kept
compatibility
old
spec
undeclared
hold
persist
bus
something
human
startup
namespace
dispatcher
configures
in-memory
spent
hidden
individual
components
ignoring
fails
decide
describe
collector
summary
allowing
assignment
construction
printer
terminal
writable
mount
idle
deletes
normally
period
observer
cycle
obtains
compare
deserialization
modified
dirty
occur
unbounded
ignore
points
lookup
diff
ready
buffers
invalidates
versions
alias
series
fluent
configure
comparison
operators
operator
left
calculated
correct
allocation
anonymous
collide
onto
exits
exposed
supporting
far
due
associate
shape
converted
trust
caused
identified
criteria
unknown
tuple
bounds
indices
integer
recovery
|
str
==
levels
cause
appended
copied
takes
read-only
expressed
declare
finishes
temporarily
uid
sticky
describes
codes
matched
plus
colors
sends
recording
streams
logger
fit
shift
higher
capacity
operating
windows
jni
compares
potentially
written
kb
physical
inactive
virtual
machine
heap
measurement
average
free
escaping
equality
puts
ordinal
distinct
characters
dump
took
separated
following
attempts
follows
belongs
identity
modification
below
extend
\
foo
destroy
notified
along
remaining
serializable
trying
waits
fetches
delayed
atomic
primitive
specification
affect
identifies
unchecked
transforms
references
descriptor
presence
verify
assert
advance
matcher
involved
regression
broken
mapper
restriction
cleared
works
resolved
mock
sure
track
switch
received
making
precedence
patterns
stopping
random
terminate
separate
passing
unchanged
consequently
tokens
reported
relevant
inject
assertion
exclude
world
permissions
rendered
transient
clearing
subclass
scenario
later
throwing
variant
queues
ids
futures
unused
formats
forces
increment
externally
initialize
combine
transfer
blocks
assertions
dot
float
scanner
compound
<em>
</em>
</pre>
init
serializer
encodes
base64
key-value
look
bottom
shows
hides
metrics
binder
wrap
less
toolbar
</i>
monitor
allocate
indexes
recent
ok
transaction
older
n.
question
member
@deprecated
failures
wrapped
notifies
interval
counters
sleeping
publish
slots
atomically
realm
principal
role
tested
connector
bootstrap
etc.
section
metric
validator
health
jdbc
managed
dao
timer
servlet
threshold
hostname
units
route
fills
entities
activate
clazz
v
b
compressed
converter
pos
region
reader
ip
desc
m
push
codec
fixme
param
db
invoker
origin
disconnected
channel
encode
decode
connect
side
inv
resolver
fault
<pre>
hessian
setter
z
b16
b8
b32
b24
packet
utf-8
hashcode
applications
encryption
framed
proceeding
bulk
scrolling
early
comma
routing
score
docs
hits
aggregated
hit
sorting
tracked
rescorer
hosts
elasticsearch
cluster
retry
round
terms
extracted
weight
sizes
unassigned
explanation
allocated
%
transport
ingest
breaker
xcontent
yaml
restarts
repository-specific
snapshots
rename
restored
replaced
initializing
stage
holds
master
pending
associates
trip
span
wildcard
flush
age
segments
templates
upgrade
pipeline
versioning
indexed
ttl
positive
translog
multi
responses
simply
really
term
synchronous
protected
usually
counter
vector
vectors
offsets
analyzer
able
driver
ports
unregisters
restores
simulates
prefer
registration
verification
persistence
meta
rejected
difference
states
serialized
apis
again
refreshes
minimal
eligible
low
high
holding
moves
negative
slice
accommodate
wraps
alternative
stopped
coordinates
polygon
linear
geohash
precision
longitude
latitude
lucene
binds
accepts
invokes
exposes
injector
lookups
converters
super
supertype
superclass
<i>
nullable
consistent
commit
phrase
rate
network.host
nor
infinite
zone
unnamed
degree
meters
min
inclusive
undefined
slot
succeeds
opaque
best
ping
newly
guaranteed
yourself
uuid
async
ongoing
manage
op
synchronously
latest
estimation
implementations
numeric
leading
fuzzy
sub
boost
geo
searchable
expert
frequency
bounding
corner
docvalue
respective
locale
opens
es
behind
big
peer
three
registering
percent
receive
chunk
descriptors
resolvers
and/or
destination
permission
readers
asynchronous
issue
inline
buckets
deferred
bucket
ranges
hint
accurate
accuracy
significant
digits
highlight
gap
highlighted
encoder
schedule
modes
rewrite
categories
persisted
cells
smoothing
channels
tcp
iso
digit
year
month
week
hour
day
combines
break
mask
setters
broadcast
prevents
#
randomly
expired
notifications
ipv4
ipv6
scoped
multicast
rounding
dst
simulate
isolation
power
ifd
orientation
unnecessary
bodies
upstream
lifecycle
recommended
come
emitted
rectangle
samples
variance
coefficient
matrix
matrices
occurrences
loops
guard
bridge
initializers
program
getters
ctx
percolate
sleep
launched
cors
strength
signer
ec2
j
dns
home
gateway
blocked
rolling
admin
obtained
apps
primarily
subscriber
subscribers
us
microseconds
frames
decoder
played
volume
no-op
ms
drm
front
queued
atom
quick
capture
rfc
renderer
surface
texture
video
presentation
preferred
canvas
zero-based
floating
percentile
divisor
jax-
content-
bool
effects
flex
horizontal
disposes
gif
gesture
detector
accessibility
viewport
overlay
supplier
animations
layers
drawing
begins
fading
layer
rect
transformation
rounded
recognition
attached
drawn
drawee
attach
drawables
displays
paint
gwt
receiving
callers
hexadecimal
subscribe
callbacks
area
thumbnail
producer
quality
jpeg
frees
synchronization
bucketed
job
scaling
correction
angle
rendering
preview
rotate
scrolls
draws
pivot
radians
tap
descendant
theme
widget
thumb
animates
blocking
typed
closest
pixel
insertion
encrypted
columns
trailing
observable
emit
plain
prepared
overriden
schema
to-many
relationship
sparse
ascii
iterators
cleanup
let
acquire
ancestor
multiset
iterables
polled
endpoint
endpoints
intersection
natural
cell
as-is
connecting
measured
java.lang.
dataset
identifying
instantiate
services
navigation
proxied
repeated
rates
enter
daemon
hystrix
semaphore
beyond
invokable
short-circuit
thread/semaphore
mixture
publisher
scheduler
degrees
conference
wifi
card
feedback
sessions
tile
animate
camera
google
indicated
preferences
foreground
gravity
grid
tracker
dark
fi
picture
bean
beans
mobile
ticket
fires
projection
accessor
enumeration
tell
fixture
org.jetbrains.kotlin.serialization.
qualified_names
table.
qualified_name
int32
annotation.
argument.
array_element
type.
flexible_upper_bound
outer_type
abbreviated_type
type_id
class_name
type_parameter
upper_bound
upper_bound_id
supertype_id
packed
nested_class_name
type_alias
enum_entry
type_table
value_parameter
return_type
receiver_type
old_flags
return_type_id
receiver_type_id
setter_value_parameter
vararg_element_type
underlying_type
expanded_type
org.jetbrains.kotlin.serialization.js.
library.
imported_module
org.jetbrains.kotlin.serialization.jvm.
package_parts
package_fq_name
types.
jet
sealed
alter
lint
suppress
speed
wallpaper
gl
egl
posted
sound
fullscreen
vertex
shader
blending
pixmap
squared
constants
uniform
mass
angular
damping
vertices
establish
manifold
enable/disable
contact
friction
sensor
y-coordinate
density
joint
torque
set/get
anchors
motor
inverse
spring
facing
contacts
particle
fraction
multiply
obb
particles
bt
mesh
controllers
glyph
gradient
glyphs
pages
quaternion
sprite
patch
tint
regions
material
renderable
affected
mouse
gl_
builder.build
ellipse
sphere
magnification
framebuffer
vendor
triggered
press
toggles
spans
y-axis
actor
actors
scrolled
keyboard
focused
pref
alignment
spacing
widgets
leaving
undo
screenshot
toggle
receives
ripple
drawer
profiles
email
hide
clickable
mini
rtl
elevation
x-axis
legend
pie
indicators
indicator
hardware
parcel
medium
big-endian
composite
protocols
multipart
anymore
handshake
http/2
extras
confirm
tls
negotiation
io.netty.example.worldclock.
uint32
cipher
traffic
sub-classes
monitoring
disconnect
measure
authority
cookies
capabilities
interceptors
interceptor
recorder
hub
manufacturer
bluetooth
scanning
varargs
sensors
focusable
soft
interaction
scene
intents
granted
recents
monkey
backup
agent
parceling
keyguard
restrictions
mute
alarm
repeating
looper
battery
turned
pinned
obsolete
networks
inform
sim
characteristic
transactions
observers
gps
flash
exposure
quit
surfaces
gain
curve
cec
tv
receipt
geofence
radio
usb
editor
wi-
vpn
telephony
routes
roaming
nfc
dream
dozing
secure
margin
flattens
recommendations
mtp
locales
clicks
inclusion
intrinsic
#view
outline
scrollbar
invoking
insets
rating
country
gnss
kernel
accounts
stress
keyset
subscription
negate
satellite
wb
bugreport
expiration
dim
gsm
subtraction
multiplication
division
modulo
reflected
script.
delivery
mismatch
notifier
cdma
dbm
mail
sip
quad
p2p
hive
apache
catalog
orc
compaction
uc
login
chaos
customizers
tomcat
valves
jta
mbean
hibernate
aop
advice
pointcut
advisors
advisor
offending
autowire
method/constructor
dom
ejb
jndi
rmi
savepoint
convenient
jms
broker
stomp
xpath
cci
jca
blah
sock
topology
vert.x
deployment
verticle
tc
barcode
polynomial
cssstyle
